---
title: FunctionId
classe: Autodesk.Revit.Exceptions.FunctionId
namespace: Autodesk.Revit.Exceptions
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# FunctionId

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String File { get; }` | `functionId.File` | String |
| `String Function { get; }` | `functionId.Function` | String |
| `Int32 Line { get; }` | `functionId.Line` | Int32 |
| `Void GetObjectData(SerializationInfo, StreamingContext)` | `functionId.GetObjectData(info, context)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```